Revit 2027 API
RebarCoupler.GetCouplerPositionTransform Method
 Return a transform representing the relative position of the coupler at index couplerPositionIndex in the set.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Transform GetCouplerPositionTransform(
	int couplerPositionIndex
)
Public Function GetCouplerPositionTransform (
	couplerPositionIndex As Integer
) As Transform
public:
Transform^ GetCouplerPositionTransform(
	int couplerPositionIndex
)
member GetCouplerPositionTransform :
        couplerPositionIndex : int -> Transform
Parameters
couplerPositionIndex Int32
 An index between 0 and (CouplerQuantity-1).
Return Value
Transform
 Returns a transformation that is composed from : - a translation from (0, 0, 0) to coupler origin - a rotation that will align the coupler with the bar segment on which it stays.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  couplerPositionIndex is not in the range [ 0, CouplerQuantity-1 ].
See Also
Reference
RebarCoupler Class
Autodesk.Revit.DB.Structure Namespace